## Groupby:
    - A groupby operation involves some combination of splitting the object, 
    applying a function, and combining the results. 
    - This can be used to group large amounts of data and compute operations on these groups.

In [1]:
# Splitting or Aggregations or Fiteration or Transformation
import pandas as pd
import numpy as np

In [2]:
ipl_data = {'Team': ['MI', 'MI', 'Devils', 'Devils', 'Kings',
   'CSK', 'CSK', 'CSK', 'MI', 'Royals', 'Royals', 'MI'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

#### select columns methods

In [3]:
df.Team

0         MI
1         MI
2     Devils
3     Devils
4      Kings
5        CSK
6        CSK
7        CSK
8         MI
9     Royals
10    Royals
11        MI
Name: Team, dtype: object

In [4]:
df['Team']

0         MI
1         MI
2     Devils
3     Devils
4      Kings
5        CSK
6        CSK
7        CSK
8         MI
9     Royals
10    Royals
11        MI
Name: Team, dtype: object

In [5]:
df[['Team']]

      Team
0       MI
1       MI
2   Devils
3   Devils
4    Kings
5      CSK
6      CSK
7      CSK
8       MI
9   Royals
10  Royals
11      MI

In [6]:
df[['Team', 'Points']]

      Team  Points
0       MI     876
1       MI     789
2   Devils     863
3   Devils     673
4    Kings     741
5      CSK     812
6      CSK     756
7      CSK     788
8       MI     694
9   Royals     701
10  Royals     804
11      MI     690

In [7]:
df.loc[:,:]

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

In [8]:
df.loc[:,['Year','Team']]

    Year    Team
0   2014      MI
1   2015      MI
2   2014  Devils
3   2015  Devils
4   2014   Kings
5   2015     CSK
6   2016     CSK
7   2017     CSK
8   2016      MI
9   2014  Royals
10  2015  Royals
11  2017      MI

In [9]:
# access sequential columns
df.loc[:,::3] # access team and point

      Team  Points
0       MI     876
1       MI     789
2   Devils     863
3   Devils     673
4    Kings     741
5      CSK     812
6      CSK     756
7      CSK     788
8       MI     694
9   Royals     701
10  Royals     804
11      MI     690

In [10]:
df.loc[:,'Rank':'Year'] # stop is inclusive

    Rank  Year
0      1  2014
1      2  2015
2      2  2014
3      3  2015
4      3  2014
5      4  2015
6      1  2016
7      1  2017
8      2  2016
9      4  2014
10     1  2015
11     2  2017

In [11]:
df.iloc[:,1::2] # access Rank and Points

    Rank  Points
0      1     876
1      2     789
2      2     863
3      3     673
4      3     741
5      4     812
6      1     756
7      1     788
8      2     694
9      4     701
10     1     804
11     2     690

In [12]:
df.iloc[:,::-1]

    Points  Year  Rank    Team
0      876  2014     1      MI
1      789  2015     2      MI
2      863  2014     2  Devils
3      673  2015     3  Devils
4      741  2014     3   Kings
5      812  2015     4     CSK
6      756  2016     1     CSK
7      788  2017     1     CSK
8      694  2016     2      MI
9      701  2014     4  Royals
10     804  2015     1  Royals
11     690  2017     2      MI

#### loc is lable base and iloc is integer base

In [13]:
# access Team	Rank
df.drop(columns=['Year','Points'])

      Team  Rank
0       MI     1
1       MI     2
2   Devils     2
3   Devils     3
4    Kings     3
5      CSK     4
6      CSK     1
7      CSK     1
8       MI     2
9   Royals     4
10  Royals     1
11      MI     2

In [14]:
# i want the unique Team Names/find out total teams in dataset
# which teams are present
df['Team'].unique()

array(['MI', 'Devils', 'Kings', 'CSK', 'Royals'], dtype=object)

In [15]:
# How many total teams we have???
df.Team.nunique()

5

In [16]:
df['Team'].unique().size

5

In [17]:
len(df['Team'].unique())

5

In [18]:
# find out the total count (teamwise)
df['Team'].value_counts()
# default order Descending

MI        4
CSK       3
Devils    2
Royals    2
Kings     1
Name: Team, dtype: int64

In [19]:
# get in ascending order
df['Team'].value_counts(ascending=True)

Kings     1
Devils    2
Royals    2
CSK       3
MI        4
Name: Team, dtype: int64

In [20]:
df

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

In [21]:
df.dtypes

Team      object
Rank       int64
Year       int64
Points     int64
dtype: object

In [22]:
# Group DataFrame using a mapper or by a Series of columns.
df.groupby('Team')
# groupby on Team column

In [23]:
# typecast above: to get an output
list(df.groupby('Team'))

[('CSK',
    Team  Rank  Year  Points
  5  CSK     4  2015     812
  6  CSK     1  2016     756
  7  CSK     1  2017     788),
 ('Devils',
       Team  Rank  Year  Points
  2  Devils     2  2014     863
  3  Devils     3  2015     673),
 ('Kings',
      Team  Rank  Year  Points
  4  Kings     3  2014     741),
 ('MI',
     Team  Rank  Year  Points
  0    MI     1  2014     876
  1    MI     2  2015     789
  8    MI     2  2016     694
  11   MI     2  2017     690),
 ('Royals',
        Team  Rank  Year  Points
  9   Royals     4  2014     701
  10  Royals     1  2015     804)]

In [24]:
tm = df.groupby('Team')
tm

In [25]:
for i in tm:
    print(i, end='\n\n')

('CSK',   Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756
7  CSK     1  2017     788)

('Devils',      Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673)

('Kings',     Team  Rank  Year  Points
4  Kings     3  2014     741)

('MI',    Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690)

('Royals',       Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804)

In [26]:
np.unique(df.Team) # follow alphabatic order

array(['CSK', 'Devils', 'Kings', 'MI', 'Royals'], dtype=object)

In [27]:
# if i want only team from a tuple
for i in tm:
    print(i[0], end='\n\n')

CSK

Devils

Kings

MI

Royals

In [28]:
# if i want only dataFrame of team from a tuple
for i in tm:
    print(i[1], end='\n\n')

  Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756
7  CSK     1  2017     788

     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673

    Team  Rank  Year  Points
4  Kings     3  2014     741

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804

In [29]:
# if i want only team/only data of each team from a tuple: Unpacking of a tuple
for team, data in tm:
    print(team, end='\n\n')

CSK

Devils

Kings

MI

Royals

In [30]:
for team, data in tm:
    print(data, end='\n\n')

  Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756
7  CSK     1  2017     788

     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673

    Team  Rank  Year  Points
4  Kings     3  2014     741

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804

In [31]:
# fetch data of only MI
for team, data in tm:
    if team  == 'MI':
        print(data)

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [32]:
# without groupby normal solutions:fetch data of only MI
df[df.Team == 'MI']

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [33]:
# to get same answer use query
df.query('Team == "MI"')

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [34]:
# groups(): it gives team name: index(where it is present)
df.groupby('Team').groups

{'CSK': [5, 6, 7], 'Devils': [2, 3], 'Kings': [4], 'MI': [0, 1, 8, 11], 'Royals': [9, 10]}

In [35]:
k = df.groupby('Team').groups
k

{'CSK': [5, 6, 7], 'Devils': [2, 3], 'Kings': [4], 'MI': [0, 1, 8, 11], 'Royals': [9, 10]}

In [36]:
d_ind = k['Devils']
d_ind

Int64Index([2, 3], dtype='int64')

In [37]:
df.loc[d_ind,:]

     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673

In [38]:
tem = input('Enter your Team:')
ind = k[tem]
df.loc[ind,:]

Enter your Team:CSK

  Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756
7  CSK     1  2017     788

In [39]:
print('Welcome to IPL SEARCH')
print('Select your team from below:')
print(k.keys())
tem = input('Enter your Team:')
ind = k[tem]
df.loc[ind,:]

Welcome to IPL SEARCH
Select your team from below:
dict_keys(['CSK', 'Devils', 'Kings', 'MI', 'Royals'])
Enter your Team:Ajit

KeyError: 'Ajit'

In [40]:
list(df.groupby(['Team','Year']))

[(('CSK', 2015),
    Team  Rank  Year  Points
  5  CSK     4  2015     812),
 (('CSK', 2016),
    Team  Rank  Year  Points
  6  CSK     1  2016     756),
 (('CSK', 2017),
    Team  Rank  Year  Points
  7  CSK     1  2017     788),
 (('Devils', 2014),
       Team  Rank  Year  Points
  2  Devils     2  2014     863),
 (('Devils', 2015),
       Team  Rank  Year  Points
  3  Devils     3  2015     673),
 (('Kings', 2014),
      Team  Rank  Year  Points
  4  Kings     3  2014     741),
 (('MI', 2014),
    Team  Rank  Year  Points
  0   MI     1  2014     876),
 (('MI', 2015),
    Team  Rank  Year  Points
  1   MI     2  2015     789),
 (('MI', 2016),
    Team  Rank  Year  Points
  8   MI     2  2016     694),
 (('MI', 2017),
     Team  Rank  Year  Points
  11   MI     2  2017     690),
 (('Royals', 2014),
       Team  Rank  Year  Points
  9  Royals     4  2014     701),
 (('Royals', 2015),
        Team  Rank  Year  Points
  10  Royals     1  2015     804)]